# 2-8. Число 8: напишите операции сложения, вычитания, умножения и деления,
# результатом которых является число 8. Не забудьте заключить операции в команды
# print, чтобы проверить результат. Вы должны написать четыре строки кода, которые
# выглядят примерно так:
# print(5 + 3)
# Результатом должны быть четыре строки, в каждой из которых выводится число 8.

# выводим в консоль результат арефмитических действий в целочисленном значении
print(4+4)
print(12-4)
print(4*2)
print(int(16/2))

# 2-9 . Любимое число: сохраните свое любимое число в переменной . Затем при помощи пе-
# ременной создайте сообщение для вывода этого числа . Выведите это сообщение .

favorite_number = 99 # присваиваем переменной favorite_number целочисленное значение 99
print('Allah has ' + str(favorite_number) + ' names, one hundred minus one') # выводим в консоль сообщение с переменной favorite_numbers
                                                                    # конвертируя целочисленное значение в строчковое

import this
print(this)
print(type(this))